app/controllers/books_controller.rb

  def index
    @books = Book.all.order(created_at: :desc)
---
SELECT "books".* FROM "books"  ORDER BY "books"."created_at" DESC